cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xN_svd.xml
        <!-- REGISTER "LCDRAM09" -->
        <register>
          <name>LCDRAM09</name>
          <description>Display Data Memory Register 09</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 09</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM10" -->
        <register>
          <name>LCDRAM10</name>
          <description>Display Data Memory Register 10</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 10</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM11" -->
        <register>
          <name>LCDRAM11</name>
          <description>Display Data Memory Register 11</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 11</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM12" -->
        <register>
          <name>LCDRAM12</name>
          <description>Display Data Memory Register 12</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 12</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM13" -->
        <register>
          <name>LCDRAM13</name>
          <description>Display Data Memory Register 13</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 13</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM14" -->
        <register>
          <name>LCDRAM14</name>
          <description>Display Data Memory Register 14</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 14</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM15" -->
        <register>
          <name>LCDRAM15</name>
          <description>Display Data Memory Register 15</description>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 15</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM16" -->
        <register>
          <name>LCDRAM16</name>
          <description>Display Data Memory Register 16</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 16</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM17" -->
        <register>
          <name>LCDRAM17</name>
          <description>Display Data Memory Register 17</description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 17</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDRAM18" -->
        <register>
          <name>LCDRAM18</name>
          <description>Display Data Memory Register 18</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCDRAM" -->
            <field>
              <name>LCDRAM</name>
              <description>Display Data 18</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
