cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xN_svd.xml
        <!-- REGISTER "PZR0" -->
        <register>
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001C00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PZR0</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PZR0</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PZR0</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR4" -->
        <register>
          <name>PZR4</name>
          <description>Port Pseudo Open Drain Setting Register 4</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description>Bit14 of PZR4</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description>Bit13 of PZR4</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PZR4</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZR6" -->
        <register>
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HDMICEC0" -->
    <peripheral>
      <name>HDMICEC0</name>
      <description>HDMI-CEC ch.0</description>
      <groupName>HDMICEC0</groupName>
      <baseAddress>0x40034000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x49</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x61</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x64</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "HDMICEC0" -->
      <interrupt>
        <name>HDMICEC0</name>
        <value>36</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "TXCTRL" -->
        <register>
          <name>TXCTRL</name>
          <description>Transmission Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IBREN" -->
            <field>
              <name>IBREN</name>
              <description>Bus error detection interrupt enable bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ITSTEN" -->
            <field>
              <name>ITSTEN</name>
              <description>transmission status interrupt enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOM" -->
            <field>
              <name>EOM</name>
              <description>EOM setting bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "START" -->
            <field>
              <name>START</name>
              <description>START setting bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXEN" -->
            <field>
              <name>TXEN</name>
              <description>Transmission operation enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXDATA" -->
        <register>
          <name>TXDATA</name>
          <description>Transmission Data Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description>Transmission Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
