cmsis-svd/cmsis-svd/data/Spansion/MB9AFA4xN_svd.xml
        <!-- REGISTER "WIER" -->
        <register>
          <name>WIER</name>
          <description>Deep Standby Return Enable Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x033B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEC1E" -->
            <field>
              <name>WCEC1E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.1 interrupt return enable bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCEC0E" -->
            <field>
              <name>WCEC0E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.0 interrupt return enable bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3E" -->
            <field>
              <name>WUI3E</name>
              <description>WKUP pin input return enable bit 3</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2E" -->
            <field>
              <name>WUI2E</name>
              <description>WKUP pin input return enable bit 2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1E" -->
            <field>
              <name>WUI1E</name>
              <description>WKUP pin input return enable bit 1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WLVDE" -->
            <field>
              <name>WLVDE</name>
              <description>LVD interrupt return enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRTCE" -->
            <field>
              <name>WRTCE</name>
              <description>RTC interrupt return enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WILVR" -->
        <register>
          <name>WILVR</name>
          <description>WKUP Pin Input Level Register</description>
          <addressOffset>0x710</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI3LV" -->
            <field>
              <name>WUI3LV</name>
              <description>WKUP pin input level select bit 3</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2LV" -->
            <field>
              <name>WUI2LV</name>
              <description>WKUP pin input level select bit 2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1LV" -->
            <field>
              <name>WUI1LV</name>
              <description>WKUP pin input level select bit 1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSRAMR" -->
        <register>
          <name>DSRAMR</name>
          <description>Deep Standby RAM Retention Register</description>
          <addressOffset>0x714</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRAMR" -->
            <field>
              <name>SRAMR</name>
              <description>On-chip SRAM retention control bits</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BUR01" -->
        <register>
          <name>BUR01</name>
          <description>Backup Registers from 1</description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR02" -->
        <register>
          <name>BUR02</name>
          <description>Backup Registers from 2</description>
          <addressOffset>0x801</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR03" -->
        <register>
          <name>BUR03</name>
          <description>Backup Registers from 3</description>
          <addressOffset>0x802</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR04" -->
        <register>
          <name>BUR04</name>
          <description>Backup Registers from 4</description>
          <addressOffset>0x803</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR05" -->
        <register>
          <name>BUR05</name>
          <description>Backup Registers from 5</description>
          <addressOffset>0x804</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR06" -->
        <register>
          <name>BUR06</name>
          <description>Backup Registers from 6</description>
          <addressOffset>0x805</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
